robert-hh/micropython/ports/mimxrt/machine_sdcard.c
STATIC mimxrt_sdcard_obj_t mimxrt_sdcard_objs[1] = {
    {
        .base.type = &machine_sdcard_type,
        .sdcard = USDHC1,
        .initialized = false,
        .rca = 0x0UL,
        .block_len = SDMMC_DEFAULT_BLOCK_SIZE,
        .block_count = 0UL,
    }
};

STATIC const mp_arg_t allowed_args[] = {
    [SDCARD_INIT_ARG_ID]     { MP_QSTR_id, MP_ARG_INT, {.u_int = 0} },
};


static void decode_csd(mimxrt_sdcard_obj_t *sdcard, csd_t *csd) {
    sdcard->block_len = (1U << (csd->read_bl_len));
    sdcard->block_count = ((csd->c_size + 1U) << (csd->c_size_mult + 2U));

    if (sdcard->block_len != SDMMC_DEFAULT_BLOCK_SIZE) {
        sdcard->block_count = (sdcard->block_count * sdcard->block_len);
        sdcard->block_len = SDMMC_DEFAULT_BLOCK_SIZE;
        sdcard->block_count = (sdcard->block_count / sdcard->block_len);
    }
}

static void sdcard_check_status(status_t status, uint8_t command) {
    if (status != kStatus_Success) {
        mp_printf(&mp_plat_print, "CMD %d failed!", command);
        switch (status)
        {
            case (kStatus_USDHC_BusyTransferring): {
                mp_printf(&mp_plat_print, " - BusyTransferring (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_PrepareAdmaDescriptorFailed): {
                mp_printf(&mp_plat_print, " - PrepareAdmaDescriptorFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_SendCommandFailed): {
                mp_printf(&mp_plat_print, " - SendCommandFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TransferDataFailed): {
                mp_printf(&mp_plat_print, " - TransferDataFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_DMADataAddrNotAlign): {
                mp_printf(&mp_plat_print, " - DMADataAddrNotAlign (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_ReTuningRequest): {
                mp_printf(&mp_plat_print, " - ReTuningRequest (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TuningError): {
                mp_printf(&mp_plat_print, " - TuningError (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_NotSupport): {
                mp_printf(&mp_plat_print, " - NotSupport (%d)\n", status);
                break;
            }
            default: {
                mp_printf(&mp_plat_print, " - Unknown\n");
                break;
            }
        }
    }
}

static void sdcard_card_status(uint8_t current_state) {
    switch (current_state)
    {
        case SDCARD_STATE_IDLE: {
            mp_printf(&mp_plat_print, "Card State: StateIdle\n");
            break;
        }
        case SDCARD_STATE_READY: {
            mp_printf(&mp_plat_print, "Card State: StateReady\n");
            break;
        }
        case SDCARD_STATE_IDENTIFY: {
            mp_printf(&mp_plat_print, "Card State: StateIdentify\n");
            break;
        }
        case SDCARD_STATE_STANDBY: {
            mp_printf(&mp_plat_print, "Card State: StateStandby\n");
            break;
        }
        case SDCARD_STATE_TRANSFER: {
            mp_printf(&mp_plat_print, "Card State: StateTransfer\n");
            break;
        }
        case SDCARD_STATE_SENDDATA: {
            mp_printf(&mp_plat_print, "Card State: StateSendData\n");
            break;
        }
        case SDCARD_STATE_RECEIVEDATA: {
            mp_printf(&mp_plat_print, "Card State: StateReceiveData\n");
            break;
        }
        case SDCARD_STATE_PROGRAM: {
            mp_printf(&mp_plat_print, "Card State: StateProgram\n");
            break;
        }
        case SDCARD_STATE_DISCONNECT: {
            mp_printf(&mp_plat_print, "Card State: StateDisconnect\n");
            break;
        }
        default: {
            mp_printf(&mp_plat_print, "Card State: INVALID!!!\n");
        }
    }
}

static void sdcard_cmd_go_idle_state(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_GO_IDLE_STATE,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeNone,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_GO_IDLE_STATE);
}

static uint32_t sdcard_cmd_oper_cond(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_IF_COND,
        .argument = 0x000001AAU,       // 2.7-3.3V range and 0xAA check pattern
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR7,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_SEND_IF_COND);
    return command.response[0];
}

static uint32_t sdcard_cmd_app_cmd(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_APP_CMD,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_CMD_APP_CMD);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static uint32_t sdcard_cmd_sd_app_op_cond(USDHC_Type *base, uint32_t argument) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_ACMD_SD_SEND_OP_COND,
        .argument = argument,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR3,
    };

    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SDCARD_ACMD_SD_SEND_OP_COND);
    return command.response[0];
}

